# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Sat Feb 28 15:09:56 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design npu_core_top

create_clock -name "clk" -period 1.0 -waveform {0.0 0.5} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DA[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DB[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DC[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {DD[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports EN_BUF_IN]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports EN_MAC]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports RST_MAC]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports SEL_BIAS1]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports SEL_BIAS2]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports EN_ReLU]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports BYPASS_ReLU1]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports BYPASS_ReLU2]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports LATCH_RELU]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports PISO_LOAD]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports PISO_EN]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports FIFO_WR_EN]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports FIFO_RD_EN]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {SEL_OUT[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {SEL_OUT[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {SEL_OUT[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {BIAS2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports {D_OUT[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports FIFO_FULL]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.5 [get_ports FIFO_EMPTY]
set_max_transition -clock_path 0.15 [get_clocks clk]
set_input_transition 0.5 [get_ports clk]
set_input_transition 0.5 [get_ports rst]
set_input_transition 0.5 [get_ports {DA[7]}]
set_input_transition 0.5 [get_ports {DA[6]}]
set_input_transition 0.5 [get_ports {DA[5]}]
set_input_transition 0.5 [get_ports {DA[4]}]
set_input_transition 0.5 [get_ports {DA[3]}]
set_input_transition 0.5 [get_ports {DA[2]}]
set_input_transition 0.5 [get_ports {DA[1]}]
set_input_transition 0.5 [get_ports {DA[0]}]
set_input_transition 0.5 [get_ports {DB[7]}]
set_input_transition 0.5 [get_ports {DB[6]}]
set_input_transition 0.5 [get_ports {DB[5]}]
set_input_transition 0.5 [get_ports {DB[4]}]
set_input_transition 0.5 [get_ports {DB[3]}]
set_input_transition 0.5 [get_ports {DB[2]}]
set_input_transition 0.5 [get_ports {DB[1]}]
set_input_transition 0.5 [get_ports {DB[0]}]
set_input_transition 0.5 [get_ports {DC[7]}]
set_input_transition 0.5 [get_ports {DC[6]}]
set_input_transition 0.5 [get_ports {DC[5]}]
set_input_transition 0.5 [get_ports {DC[4]}]
set_input_transition 0.5 [get_ports {DC[3]}]
set_input_transition 0.5 [get_ports {DC[2]}]
set_input_transition 0.5 [get_ports {DC[1]}]
set_input_transition 0.5 [get_ports {DC[0]}]
set_input_transition 0.5 [get_ports {DD[7]}]
set_input_transition 0.5 [get_ports {DD[6]}]
set_input_transition 0.5 [get_ports {DD[5]}]
set_input_transition 0.5 [get_ports {DD[4]}]
set_input_transition 0.5 [get_ports {DD[3]}]
set_input_transition 0.5 [get_ports {DD[2]}]
set_input_transition 0.5 [get_ports {DD[1]}]
set_input_transition 0.5 [get_ports {DD[0]}]
set_input_transition 0.5 [get_ports EN_BUF_IN]
set_input_transition 0.5 [get_ports EN_MAC]
set_input_transition 0.5 [get_ports RST_MAC]
set_input_transition 0.5 [get_ports SEL_BIAS1]
set_input_transition 0.5 [get_ports SEL_BIAS2]
set_input_transition 0.5 [get_ports EN_ReLU]
set_input_transition 0.5 [get_ports BYPASS_ReLU1]
set_input_transition 0.5 [get_ports BYPASS_ReLU2]
set_input_transition 0.5 [get_ports LATCH_RELU]
set_input_transition 0.5 [get_ports PISO_LOAD]
set_input_transition 0.5 [get_ports PISO_EN]
set_input_transition 0.5 [get_ports FIFO_WR_EN]
set_input_transition 0.5 [get_ports FIFO_RD_EN]
set_input_transition 0.5 [get_ports {SEL_OUT[2]}]
set_input_transition 0.5 [get_ports {SEL_OUT[1]}]
set_input_transition 0.5 [get_ports {SEL_OUT[0]}]
set_input_transition 0.5 [get_ports {BIAS1[15]}]
set_input_transition 0.5 [get_ports {BIAS1[14]}]
set_input_transition 0.5 [get_ports {BIAS1[13]}]
set_input_transition 0.5 [get_ports {BIAS1[12]}]
set_input_transition 0.5 [get_ports {BIAS1[11]}]
set_input_transition 0.5 [get_ports {BIAS1[10]}]
set_input_transition 0.5 [get_ports {BIAS1[9]}]
set_input_transition 0.5 [get_ports {BIAS1[8]}]
set_input_transition 0.5 [get_ports {BIAS1[7]}]
set_input_transition 0.5 [get_ports {BIAS1[6]}]
set_input_transition 0.5 [get_ports {BIAS1[5]}]
set_input_transition 0.5 [get_ports {BIAS1[4]}]
set_input_transition 0.5 [get_ports {BIAS1[3]}]
set_input_transition 0.5 [get_ports {BIAS1[2]}]
set_input_transition 0.5 [get_ports {BIAS1[1]}]
set_input_transition 0.5 [get_ports {BIAS1[0]}]
set_input_transition 0.5 [get_ports {BIAS2[15]}]
set_input_transition 0.5 [get_ports {BIAS2[14]}]
set_input_transition 0.5 [get_ports {BIAS2[13]}]
set_input_transition 0.5 [get_ports {BIAS2[12]}]
set_input_transition 0.5 [get_ports {BIAS2[11]}]
set_input_transition 0.5 [get_ports {BIAS2[10]}]
set_input_transition 0.5 [get_ports {BIAS2[9]}]
set_input_transition 0.5 [get_ports {BIAS2[8]}]
set_input_transition 0.5 [get_ports {BIAS2[7]}]
set_input_transition 0.5 [get_ports {BIAS2[6]}]
set_input_transition 0.5 [get_ports {BIAS2[5]}]
set_input_transition 0.5 [get_ports {BIAS2[4]}]
set_input_transition 0.5 [get_ports {BIAS2[3]}]
set_input_transition 0.5 [get_ports {BIAS2[2]}]
set_input_transition 0.5 [get_ports {BIAS2[1]}]
set_input_transition 0.5 [get_ports {BIAS2[0]}]
set_clock_uncertainty -setup 0.3 [get_clocks clk]
set_clock_uncertainty -hold 0.1 [get_clocks clk]
